---
type: StructuralSectionCProfileWithLips
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionCProfileWithLips

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithLips` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionCProfileWithLips | 2016 | `public StructuralSectionCProfileWithLips ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double centroidHorizontal , double centroidVertical , double princ` |